settings.org
* packages
** melpa
#+BEGIN_SRC emacs-lisp
(add-to-list 'package-archives '("melpa" . "http://melpa.org/packages/" ) t)
(package-initialize)
#+END_SRC
* use package
*** code
#+BEGIN_SRC emacs-lisp
(require 'use-package)
#+END_SRC
* variabales for modes  
** settings
*** code
#+BEGIN_SRC emacs-lisp
(menu-bar-mode -1)
(tool-bar-mode -1)
(scroll-bar-mode -1)
;(toggle-frame-maximized)
(add-to-list 'default-frame-alist '(fullscreen . maximized))
(setq inhibit-splash-screen t)
(setq make-backup-files nil)
(global-linum-mode 1)
(defalias 'yes-or-no-p 'y-or-n-p)
(display-time-mode 1)
(display-battery-mode 1)
(setq column-number-mode t)
(global-hl-line-mode 1)
(electric-pair-mode 1)
(show-paren-mode 1)
(custom-set-faces  '(show-paren-match ((t (:underline "green")))))
(savehist-mode 1)
(global-auto-revert-mode 1)
(global-visual-line-mode 1)
(desktop-save-mode 1)
#+END_SRC
** ido
*** description
    Interactive-DO.
*** codes
#+BEGIN_SRC emacs-lisp
(ido-mode 1)
(setq ido-everywhere t)
(setq ido-enable-flex-matching t)
(setq ido-use-filename-at-point 'guess)
(setq ido-create-new-buffer 'always)
(setq ido-file-extension-order '(".org" ".txt" ".csv"))
#+END_SRC

** winner mode
*** code
#+BEGIN_SRC emacs-lisp
(winner-mode 1)
#+END_SRC

** hide show mode
*** code
#+BEGIN_SRC emacs-lisp
(add-hook 'prog-mode-hook (lambda () (hs-minor-mode 1)))
(global-set-key (kbd "C-c @ @") 'hs-hide-all)
(global-set-key (kbd "C-c @ h") 'hs-hide-block)
(global-set-key (kbd "C-c @ s") 'hs-show-block)
(global-set-key (kbd "C-c @ SPC") 'hs-show-all)
#+END_SRC

* installed packages
** Dracula theme
*** code
#+BEGIN_SRC emacs-lisp
(use-package dracula-theme
:ensure t)
#+END_SRC
** ido describe binding
** ido grid mode
#+BEGIN_SRC emacs-lisp
(ido-grid-mode 1)
#+END_SRC
** cycle themes
*** code
#+BEGIN_SRC emacs-lisp
(use-package cycle-themes
:ensure t
:init 
(setq cycle-themes-theme-list '(dracula exotica))
:config
(cycle-themes-mode))
#+END_SRC
** org bullets
#+BEGIN_SRC emacs-lisp
(use-package org-bullets
:ensure t
:init
(add-hook 'org-mode-hook (lambda() (org-bullets-mode 1))))
#+END_SRC

** ivy + swiper + counsel
*** description

*** codes
#+BEGIN_SRC emacs-lisp
(use-package counsel
:ensure t)
(use-package ivy
:ensure t
:init
(ivy-mode 1)
(setq ivy-use-virtual-buffers t)
(setq enable-recursive-minibuffers t)
:bind
(
("\C-s" . swiper)
("C-c C-r" . ivy-resume)
("<f6>" . ivy-resume)
("M-x" . counsel-M-x)
;(global-set-key (kbd "C-x C-f") 'counsel-find-file) ;;; keep IDO mode for find file
("C-y" . counsel-yank-pop)
("<f1> f" . counsel-describe-function)
("<f1> v" . counsel-describe-variable)
("<f1> l" . counsel-find-library)
("<f2> i" . counsel-info-lookup-symbol)
("<f2> u" . counsel-unicode-char)
("C-c g" . counsel-git)
("C-c j" . counsel-git-grep)
("C-c k" . counsel-ag)
("C-x l" . counsel-locate)
("C-S-o" . counsel-rhythmbox)
:map minibuffer-local-map
("C-r" . counsel-minibuffer-history))
)
#+END_SRC
** magit
*** code
#+BEGIN_SRC emacs-lisp
(use-package magit
:ensure t
:bind
("C-x g" . magit-status)
)
#+END_SRC

** iedit
*** code
#+BEGIN_SRC emacs-lisp
(use-package iedit
:ensure t)
#+END_SRC
** paredit
*** code
#+BEGIN_SRC emacs-lisp
(use-package paredit
:ensure t
:init
(paredit-mode 1)
:hook
(c++-mode . enable-paredit-mode)
:bind
("C-<left>" . paredit-forward-slurp-sexp)
("C-M-<left>" . paredit-backward-slurp-sexp)
("C-<right>" . paredit-forward-barf-sexp)
("C-M-<right>" . paredit-backward-barf-sexp)
("M-S" . paredit-split-sexp)
("M-J" . paredit-join-sexp)
)
#+END_SRC

** irony
*** code
#+BEGIN_SRC emacs-lisp
(use-package irony
:ensure t
:hook
(
(c++-mode . irony-mode)
(c-mode . irony-mode)
(irony . irony-cdb-autosetup-compile-options)
))
#+END_SRC
** company
*** code
#+BEGIN_SRC emacs-lisp
(use-package company
:ensure t
:hook
(after-init . global-company-mode)
:config
(global-company-mode t)
(setq company-minimum-prefix-length 1)
(setq company-idle-delay 0)
)
#+END_SRC
** company quickhelp
*** code
#+BEGIN_SRC emacs-lisp
(use-package company-quickhelp
:ensure t
:init
(company-quickhelp-mode 1)
:config
(setq company-quickhelp-delay 0)
)
#+END_SRC
** company irony
*** code
#+BEGIN_SRC emacs-lisp
(use-package company-irony
:ensure t
:after company
:init
(add-to-list 'company-backends 'company-irony))
#+END_SRC
** company irony c headers
*** code
#+BEGIN_SRC emacs-lisp
(use-package company-irony-c-headers
:ensure t
:after company
:init
(add-to-list
'company-backends '(company-irony-c-headers company-irony)))
#+END_SRC
** yasnippet
*** code
#+BEGIN_SRC emacs-lisp
(use-package yasnippet
:ensure t
:init
(yas-global-mode 1)
(defun check-expansion ()
    (save-excursion
      (if (looking-at "\\_>") t
        (backward-char 1)
        (if (looking-at "\\.") t
          (backward-char 1)
          (if (looking-at "->") t nil)))))

  (defun do-yas-expand ()
    (let ((yas/fallback-behavior 'return-nil))
      (yas/expand)))

  (defun tab-indent-or-complete ()
    (interactive)
    (if (minibufferp)
        (minibuffer-complete)
      (if (or (not yas/minor-mode)
              (null (do-yas-expand)))
          (if (check-expansion)
              (company-complete-common)
            (indent-for-tab-command)))))
:bind
  ([tab] . tab-indent-or-complete)
)
#+END_SRC
** yasnippet snippets
** ivy yasnippet
*** code
#+BEGIN_SRC emacs-lisp
(use-package ivy-yasnippet
:ensure t
:init
(add-hook 'yas-minor-mode 'ivy-snippet)
:bind
("M-z" . ivy-yasnippet)
)
#+END_SRC
** highlight indentation guide
*** code
#+BEGIN_SRC emacs-lisp
(use-package highlight-indent-guides
:ensure t
:hook
(c++-mode . highlight-indent-guides-mode)
:init
(setq highlight-indent-guides-method 'character)
)
#+END_SRC
* keybindings
*** codes
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-?") 'hippie-expand)
(global-set-key (kbd "M-D") 'backward-kill-word )
(global-set-key (kbd "DEL") 'backward-delete-char)
(global-set-key (kbd "C-z") 'replace-string)
(global-set-key (kbd "C-M-z")'replace-regex)
(global-set-key (kbd "C-Z")'count-matches)
#+END_SRC

* themes
*** code
#+BEGIN_SRC emacs-lisp
(load-theme 'dracula t)
#+END_SRC

* good features to remember
** movement keys

   These are some basic key combo in emacs.

 |-----------+---------------------------------|
 | key combo | effect                          |
 |-----------+---------------------------------|
 | C-f       | forward char                    |
 | C-b       | backward char                   |
 | C-n       | next line                       |
 | C-p       | previous line                   |
 | C-a       | beginging of line               |
 | C-e       | end of line                     |
 | C-x [     | forward one page                |
 | C-x ]     | backward one page               |
 |-----------+---------------------------------|
 | M-f       | forward word                    |
 | M-b       | backward word                   |
 | M-m       | first non whitespace            |
 | M-}       | move beginging of a paragraph   |
 | M-{       | move beginging of a paragraph   |
 | M-a       | move beginging of a sentence    |
 | M-e       | move beginging of a sentence    |
 | M-<       | move to begining of buffer      |
 | M->       | move to end of buffer           |
 |-----------+---------------------------------|
 | C-M-f     | forward s-expression            |
 | C-M-b     | backward s-expression           |
 | C-M-d     | move down to a list             |
 | C-M-u     | move up out of list             |
 | C-M-n     | move to next list               |
 | C-M-p     | move to previous list           |
 | C-M-a     | move to begining of defun       |
 | C-M-e     | move to end of defun            |
 |-----------+---------------------------------|
 | C-v       | scroll down one page            |
 | M-v       | scroll up one page              |
 | C-M-v     | scroll down other window        |
 | C-M-S-v   | scroll up other window          |
 |-----------+---------------------------------|
 | C-x r m   | set a bookmark                  |
 | C-x r l   | list a bookmark                 |
 | C-x r b   | jump to a bookmark              |
 |-----------+---------------------------------|
 | C-x r n   | store number in resistor        |
 | C-x r s   | store region in resistor        |
 | C-x r SPC | store point in resistor         |
 | C-x r +   | increment content in resistor   |
 | C-x r j   | jump to resistor                |
 | C-x r i   | insert content of resistor      |
 | C-x r w   | store window config in resistor |
 | C-x r f   | store frameset in resistor      |
 |-----------+---------------------------------|
 | C-SPC     | mark the region                 |
 | C-u C-SPC | Jump to mark                    |
 | C-x C-x   | exchanges mark & point          |
 |-----------+---------------------------------|
 | M-h       | Mark Next paragraph             |
 | C-x h     | Mark whole buffer               |
 | C-M-h     | mark next defun                 |
 | C-x C-p   | mark next page                  |
 | M-@       | mark next word                  |
 | C-M-@     | mark next s expression          |
 |-----------+---------------------------------|


